In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.2.2-cp311-cp311-win_amd64.whl (11.6 MB)
     --------------------------------------- 11.6/11.6 MB 10.2 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.23.2 in c:\users\vanraj\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.24.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\vanraj\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1
  Using cached pytz-2024.1-py2.py3-none-any.whl (505 kB)
Collecting tzdata>=2022.7
  Using cached tzdata-2024.1-py2.py3-none-any.whl (345 kB)
Requirement already satisfied: six>=1.5 in c:\users\vanraj\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.2 pytz-2024.1 tzdata-2024.1
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3.1 -> 24.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [3]:
# Creating a Series
data = [1,2,3,5,6]
series = pd.Series(data)
print("Series: ",series)

Series:  0    1
1    2
2    3
3    5
4    6
dtype: int64

In [4]:
#Creating series from dictionary
data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print("Series:",series_dict)

Series: a    1
b    2
c    3
dtype: int64

In [5]:
data = [10,20,30]
index = ['a','b','c']

pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [7]:
data = {
    'Name': ['Vanraj','John','Jack'],
    'Age':[23,50,20],
    'City': ['Mumbai','Bangalore','Tokyo']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age       City
0  Vanraj   23     Mumbai
1    John   50  Bangalore
2    Jack   20      Tokyo
<class 'pandas.core.frame.DataFrame'>

In [9]:
# Create a Data frame from a list of dictionaries
data = [
    {'Name':'Vanraj','Age':23,'City':'Mumbai'},
    {'Name':'Kunal','Age':23,'City':'Pratapgarh'},
    {'Name':'Abhay','Age':23,'City':'Jharkhand'},
]

df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age        City
0  Vanraj   23      Mumbai
1   Kunal   23  Pratapgarh
2   Abhay   23   Jharkhand
<class 'pandas.core.frame.DataFrame'>

In [11]:
df.loc[0]

Name    Vanraj
Age         23
City    Mumbai
Name: 0, dtype: object

In [12]:
df.iloc[0]

Name    Vanraj
Age         23
City    Mumbai
Name: 0, dtype: object

In [13]:
df

     Name  Age        City
0  Vanraj   23      Mumbai
1   Kunal   23  Pratapgarh
2   Abhay   23   Jharkhand

In [14]:
df.at[2,'Age']

23

In [15]:
df.at[1,'Name']

'Kunal'

In [16]:
# Accessing specified element using iat
df.iat[2,2]

'Jharkhand'

In [24]:
df['Salary'] = [1000,230000,2304203]
df

     Name  Age        City   Salary
0  Vanraj   23      Mumbai     1000
1   Kunal   23  Pratapgarh   230000
2   Abhay   23   Jharkhand  2304203

In [25]:
# Remove a column
df.drop('Salary',axis=1,inplace=True)
df

     Name  Age        City
0  Vanraj   23      Mumbai
1   Kunal   23  Pratapgarh
2   Abhay   23   Jharkhand

In [26]:
df['Age'] = df['Age']+1
df

     Name  Age        City
0  Vanraj   24      Mumbai
1   Kunal   24  Pratapgarh
2   Abhay   24   Jharkhand

In [27]:
df.drop(0,inplace=True)

In [28]:
df

    Name  Age        City
1  Kunal   24  Pratapgarh
2  Abhay   24   Jharkhand

In [29]:
df.describe()

        Age
count   2.0
mean   24.0
std     0.0
min    24.0
25%    24.0
50%    24.0
75%    24.0
max    24.0